# FabricParamSpanSymDRight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamSpanSymDRight Property
ParameterTypeId Class See Also
---
"D_Right"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamSpanSymDRight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamSpanSymDRight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamSpanSymDRight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace